gdgly/stm32L151_nbiot_tmote_app_workspace/hc32L196_nbiot_tmote_app_spot/User/platform_map.c
/**
  *********************************************************************************************************
  * @file    platform_map.c
  * @author  Movebroad -- KK
  * @version V1.0
  * @date    2020-03-09
  * @brief   1TAB = 5Speace
  *********************************************************************************************************
  * @attention
  *
  *
  *
  *********************************************************************************************************
  */

#include "hc32l19x_config.h"
#include "platform_config.h"
#include "platform_map.h"
#include "delay.h"
#include "usart.h"
#include "hal_iwdg.h"
#include "hal_rtc.h"
#include "hal_beep.h"
#include "hal_vbat.h"
#include "hal_vptat.h"
#include "hal_vtemp.h"
#include "hal_aes.h"
#include "hal_crc.h"
#include "hal_flash.h"
#include "hal_iic.h"
#include "hal_bl24cxxp.h"
#include "hal_eeprom.h"
#include "hal_qmc5883l.h"
#include "hal_spi.h"
#include "hal_p25qxxh.h"
#include "hal_norflash.h"
#include "fifo.h"
#include "message.h"
#include "radio_hal_rf.h"
#include "radio_hal_app.h"
#include "fota.h"
#include "tmesh_xtea.h"

TCFG_SystemDataTypeDef TCFG_SystemData;





















/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_SystemConfigInfo_Init(void)
 @Description			TCFG_EEPROM_SystemConfigInfo_Init				: 系统配置信息初始化
 @Input				void
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_SystemConfigInfo_Init(void)
{
	TCFG_EEPROM_ReadSystemConfigData();
	
	TCFG_EEPROM_Set_BootMode(TCFG_ENV_BOOTMODE_NORMALLY);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_WriteSystemConfigData(void)
 @Description			TCFG_EEPROM_WriteSystemConfigData				: 写入系统配置信息
 @Input				void
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_WriteSystemConfigData(void)
{
	/* 写入Radio RF 通道 */
	TCFG_SystemData.RadioChannel = RADIO_RF_CHANNEL1;
	TCFG_EEPROM_Set_RadioChannel(TCFG_SystemData.RadioChannel);
	
	/* 写入Radio RF 心跳 */
	TCFG_SystemData.RadioHeartval = RADIO_RF_HEARTVAL;
	TCFG_EEPROM_Set_RadioHeartval(TCFG_SystemData.RadioHeartval);
	
	/* 写入Device Reboot Mode重启方式 */
	TCFG_SystemData.DevRebootMode = REBOOT_MODE_NONE;
	TCFG_EEPROM_Set_DeviceRebootMode(TCFG_SystemData.DevRebootMode);
	
	/* 写入传感器灵敏度值 */
	TCFG_SystemData.Sensitivity = SENSE_MIDDLE;
	TCFG_EEPROM_Set_Sensitivity(TCFG_SystemData.Sensitivity);
	
	/* 写入工作模式 */
	TCFG_SystemData.WorkMode = WORK_MODE_NORMAL;
	TCFG_EEPROM_Set_WorkMode(TCFG_SystemData.WorkMode);
	
	/* 写入休眠模式 */
	TCFG_SystemData.IdleMode = IDLE_MODE_DISABLE;
	TCFG_EEPROM_Set_IdleMode(TCFG_SystemData.IdleMode);
	
	/* 写入运行模式 */
	TCFG_SystemData.ActiveMode = ACTIVE_MODE_ENABLE;
	TCFG_EEPROM_Set_ActiveMode(TCFG_SystemData.ActiveMode);
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	/* SN & Vender Write to Backup space */
	TCFG_EEPROM_Set_Backup_MAC_SN(TCFG_EEPROM_Get_Source_MAC_SN());
	TCFG_EEPROM_Set_Backup_Vender(TCFG_EEPROM_Get_Source_Vender());
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_WriteParameterData(void)
 @Description			TCFG_EEPROM_WriteParameterData				: 写入系统参数信息
 @Input				void
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_WriteSystemParamtData(void)
{
	
	
	
	
	
	
	
	
	
	
	/* Software Write to Backup space */
	TCFG_EEPROM_Set_Backup_SoftwareMajor(TCFG_EEPROM_Get_Source_SoftwareMajor());
	TCFG_EEPROM_Set_Backup_SoftwareMinor(TCFG_EEPROM_Get_Source_SoftwareMinor());
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_ReadSystemConfigData(void)
 @Description			TCFG_EEPROM_ReadSystemConfigData				: 读取系统配置信息
 @Input				void
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_ReadSystemConfigData(void)
{
	/* 获取MacSN */
	TCFG_SystemData.MacSN = TCFG_EEPROM_Get_MAC_SN();
	
	/* 获取Vender */
	TCFG_SystemData.Vender = TCFG_EEPROM_Get_Source_Vender();
	
	/* 获取MacSN String */
	TCFG_EEPROM_Get_MAC_SN_String();
	
	/* 获取Vender String */
	TCFG_EEPROM_Get_Vender_String();
	
	/* 获取BOOT版本号 */
	TCFG_SystemData.BootVersion = TCFG_EEPROM_Get_BootVersion();
	
	/* 获取BOOT运行模式 */
	TCFG_SystemData.BootRunmode = TCFG_EEPROM_Get_BootMode();
	
	/* 获取BOOT重启次数 */
	TCFG_SystemData.BootRecount = TCFG_EEPROM_Get_BootCount();
	
	/* 获取Radio RF 通道 */
	TCFG_SystemData.RadioChannel = TCFG_EEPROM_Get_RadioChannel();
	if ((TCFG_SystemData.RadioChannel != 36) && (TCFG_SystemData.RadioChannel != 4) && (TCFG_SystemData.RadioChannel != 6) && (TCFG_SystemData.RadioChannel != 16) && (TCFG_SystemData.RadioChannel != 26)) {
		TCFG_SystemData.RadioChannel = RADIO_RF_CHANNEL1;
		TCFG_EEPROM_Set_RadioChannel(TCFG_SystemData.RadioChannel);
	}
	
	/* 获取Radio RF 心跳 */
	TCFG_SystemData.RadioHeartval = TCFG_EEPROM_Get_RadioHeartval();
	if ((TCFG_SystemData.RadioHeartval < 1) || (TCFG_SystemData.RadioHeartval > 120)) {
		TCFG_SystemData.RadioHeartval = RADIO_RF_HEARTVAL;
		TCFG_EEPROM_Set_RadioHeartval(TCFG_SystemData.RadioHeartval);
	}
	
	/* 获取Device Reboot Mode重启方式 */
	TCFG_SystemData.DevRebootMode = TCFG_EEPROM_Get_DeviceRebootMode();
	
	/* 获取传感器灵敏度值 */
	TCFG_SystemData.Sensitivity = TCFG_EEPROM_Get_Sensitivity();
	if ((TCFG_SystemData.Sensitivity < SENSE_HIGHEST) || (TCFG_SystemData.Sensitivity > SENSE_LOWEST)) {
		TCFG_SystemData.Sensitivity = SENSE_MIDDLE;
		TCFG_EEPROM_Set_Sensitivity(TCFG_SystemData.Sensitivity);
	}
	
	/* 获取工作模式 */
	TCFG_SystemData.WorkMode = TCFG_EEPROM_Get_WorkMode();
	if ((TCFG_SystemData.WorkMode != WORK_MODE_NORMAL) && (TCFG_SystemData.WorkMode != WORK_MODE_DEBUG)) {
		TCFG_SystemData.WorkMode = WORK_MODE_NORMAL;
		TCFG_EEPROM_Set_WorkMode(TCFG_SystemData.WorkMode);
	}
	
	/* 获取休眠模式 */
	TCFG_SystemData.IdleMode = TCFG_EEPROM_Get_IdleMode();
	if ((TCFG_SystemData.IdleMode != IDLE_MODE_DISABLE) && (TCFG_SystemData.IdleMode != IDLE_MODE_ENABLE)) {
		TCFG_SystemData.IdleMode = IDLE_MODE_DISABLE;
		TCFG_EEPROM_Set_IdleMode(TCFG_SystemData.IdleMode);
	}
	
	/* 获取运行模式 */
	TCFG_SystemData.ActiveMode = TCFG_EEPROM_Get_ActiveMode();
	if ((TCFG_SystemData.ActiveMode != ACTIVE_MODE_DISABLE) && (TCFG_SystemData.ActiveMode != ACTIVE_MODE_ENABLE)) {
		TCFG_SystemData.ActiveMode = ACTIVE_MODE_ENABLE;
		TCFG_EEPROM_Set_ActiveMode(TCFG_SystemData.ActiveMode);
	}
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
